# Задача 2
# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10,-9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]
import os;
os.system('clear')
min_1 = int(input("Input min - "))
max_2 = int(input("Input max - "))
list_1 = [-5, 9, 0, 3, -1, -2, 1, 4,-2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print([i for i in range(len(list_1)) if 
       list_1[i] > min_1 and list_1[i] < max_2])